{"inkVersion":20,"root":[["^You pick up the phone and are greeted the a warm and loving voice of your mom","\n","^Mom: Hi Honey. How are you??","\n","^Riley: I'm doing AMAZING MOM!! ",{"#":"thoughts"},"\n","^Uhmm never better mom.","\n","^Mom: Right. How are you really?","\n","ev","str","^Like the queen of the world.","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^I'm okay mom, really.","/str","/ev",{"*":"0.c-1","flg":20},{"c-0":[{"->":"Negative"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":[{"->":"Postive"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Negative":[["^Mom: I'm sesnsing sarcasim. I'm not sure if you're being serious or no-","\n","^Riley: So how's your trip mom, everything going alrgiht??","\n","^Mom: Everything is great... but that not why I called. I called to check up on you, I know the news aren't the best new you've gotten this week. Are you sure you don't wanna talk","\n","ev","str","^You're not here anyway mom, how will i talk to you","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Nope, I've already spoken to Ezra about it so I'm good.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"P1"},"\n",{"#f":5}],"c-1":["^ ",{"->":"N1"},"\n",{"#f":5}]}],{"#f":1}],"P1":["ev",{"VAR?":"mental_health"},15,"+",{"VAR=":"mental_health","re":true},"/ev","^Mom: Just because i'm not there doesn't mean we cant talk.","\n","^Riley: It hasnt been easy mom, not at all. After i got out of sergery this morning I couldn't help but think if i'll ever be as good as before.","\n","^It's not easy being someone who portrayed themself as strong, fealess and almost invincible.","\n","^Now look at me, injured, helpless and weak.","\n","^Mom: Listen to me Riley, you're not weak. The fact that you had the courgae to opt for the surgery to help heal your knee takes a lot of courage. Having a minor setback isn't a weakness... and the fact that you gathered the courage to talk to me about how you feel says alot about you will to push and get better","\n","^Riley:...","\n","^Mom: You may even comeback 10x stronger than you were before, hell even a better athlete than before. What I'm saying is asking for help isn't a weakness, asking to talk about how you fell isnt a weakness, and I know for a fact you're going to get back out there and kick ass.","\n","^You pause as your mom's words of encouragement sink in and wonder throught you mind.","\n","^Riley: Wow mom i didn't think you had it in you... you go girl!!","\n","^You both laugh as you share a sweet mother daughter moment.","\n","^Riley: In all honesty i think these are words i need to hear from you mom. It really means alot to me that you know when to say the right thing even though you aren't physically here to support me.","\n","^Mom: You know I've always got you my baby.","\n","^Riley: moooooomm, I told you to stop calling me that ",{"->":"Cont"},"\n",{"#f":1}],"N1":["ev",{"VAR?":"mental_health"},10,"-",{"VAR=":"mental_health","re":true},"/ev","^Mom: Oh okay then... i guess my little baby doesn't need me after all","\n","^Riley: Moooomm... I told you to stop caliing me that","\n","^Mom: Well i'm your mom and i can do whatever i want.","\n","^Riley: Wow...","\n","^You both laugh and pause for a bit. ",{"->":"Cont"},"\n",{"#f":1}],"Postive":[["^Mom: Okay Ri,spit it out what on your mind. I know for sure this isn't how you talk and you've just been hit with a massive missile.","\n","ev","str","^I'm handling it pretty well i guess...","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Ezra's here to help so you have nothing to worry about","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"P2"},"\n",{"#f":5}],"c-1":["^ ",{"->":"N2"},"\n",{"#f":5}]}],{"#f":1}],"P2":["ev",{"VAR?":"mental_health"},15,"+",{"VAR=":"mental_health","re":true},"/ev","^Mom: Alright kiddo talk to me. ",{"->":"P1"},"\n",{"#f":1}],"N2":["ev",{"VAR?":"mental_health"},10,"-",{"VAR=":"mental_health","re":true},"/ev","^Mom: Okay your highness. I see you don't need me anymore","\n","^Riley: You're kinda half way across the world soooo...","\n","^Mom: Oh shut!","\n","^You both laugh and there's a short duration of silence. ",{"->":"Cont"},"\n",{"#f":1}],"Cont":[["^Mom: Okay so I've called Dr Harthorn, she referred you to a physiotherapist. Her name's Dr Andrews she'll be helping you with your recovery plan.","\n","^Riley: Okay cool. So when do i meet her??","\n","^Mom: Tomorrow at 10:30am. So you need to be ready by then. I 'll speak to Ezra and he'll take you there.","\n","ev","str","^Yaaayy","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Coolio","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":"N3"},"\n",{"#f":5}],"c-1":["^ ",{"->":"p3"},"\n",{"#f":5}]}],{"#f":1}],"p3":["ev",{"VAR?":"mental_health"},5,"-",{"VAR=":"mental_health","re":true},"/ev","^Mom: Right more sarcasm. Got it.","\n","^Alright my sweets i have to get some sleep I have a big meeting tomorrow. Don't foret to smile.","\n","^Riley:Got it mom. I'll try to smile. Love you.","\n","^Mom:Love you too.","\n","^You hang up the phone and head to bed ","end","\n",{"#f":1}],"N3":["ev",{"VAR?":"mental_health"},5,"+",{"VAR=":"mental_health","re":true},"/ev","^Mom: Okay sweets. have a good rest. I've got a big meeting tomorrow so i have to get ready for that. We'll talk soon.","\n","^Riley: Okay mom. Good luck.","\n","^Love you!","\n","^Mom: Love you too!","\n","^You hang up the phone and head to bed ","end","\n","end",{"#f":1}],"global decl":["ev",50,{"VAR=":"mental_health"},"/ev","end",null],"#f":1}],"listDefs":{}}